app/views/providers/index.html.erb

SELECT "services".* FROM "services" WHERE "services"."provider_id" = $1  [["provider_id", 1]]
---
        <td><%= provider.location %></td>
        <td> <% provider.services.each do |service| %>