app/views/providers/show.html.erb

SELECT "services".* FROM "services" WHERE "services"."provider_id" = $1  [["provider_id", 4]]
---
    <tbody>
      <% @provider.services.each do |service| %>