app/controllers/providers_controller.rb

  def index
    @providers = Provider.all
---
SELECT "providers".* FROM "providers"

    def set_provider
      @provider = Provider.find(params[:id])
---
SELECT  "providers".* FROM "providers" WHERE "providers"."id" = $1 ORDER BY "providers"."id" ASC LIMIT $2  [["id", 4], ["LIMIT", 1]]